tutorials/multiform/oilWaxFoam/pipeline2D_meshed/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    psi
    {
        solver          GAMG;
        smoother        DILU;
        tolerance       1e-10;
        relTol          1e-4;
    }

    psiFinal
    {
        $psi;
        relTol 1e-6;
    }

    p
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-10;
        relTol          1e-4;
    }

    "(U.*|sigma)"
    {
        solver          GAMG;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          1e-4;
    }

    pFinal
    {
        $p;
        relTol          1e-6;
    }

    "(U.*|sigma)Final"
    {
        $U;
        relTol          1e-6;
    }
    
    c
    {
        solver          GAMG;
        smoother        DILU;
        tolerance       1e-10;
        relTol          1e-4;
    }

    cFinal
    {
        $c;
        relTol 1e-6;
    }
    
    T
    {
        solver          GAMG;
        smoother        DILU;
        tolerance       1e-10;
        relTol          1e-4;
    }

    TFinal
    {
        $T;
        relTol 1e-6;
    }
}

PIMPLE
{
    consistent   yes;
    momentumPredictor   off;
    nOuterCorrectors    5;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    pRefCell            0;
    pRefValue           0;
    turbOnFinalIterOnly no;
    residualControl
    {
        ".*"           1e-5;
    }
}

relaxationFactors
{
    equations
    {
        ".*"   0.95;
    }
}

// ************************************************************************* //
